# GetDistanceToTargetHostFace Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetDistanceToTargetHostFace Method
RebarConstraint Class See Also
---
Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double GetDistanceToTargetHostFace()
```

Visual Basic
---
```text
Public Function GetDistanceToTargetHostFace As Double
```

Visual C++
---
```text
public:
double GetDistanceToTargetHostFace()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.' |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace